<?php
return array (
		// 系统级错误
		1 => array (
				10001 => "系统错误",
				10002 => "服务暂停",
				10003 => "远程服务错误",
				10004 => "IP限制不能请求该资源",
				10005 => "令牌不合法" 
		),
		// 服务级错误
		2 => array (
				20001 => "俱乐部id必须为数字且是必填项",
				20002 => "俱乐部活动id必须为数字且是必填项",
				20003 => "俱乐部成员申请失败",
				20004 => "你已经申请过了该俱乐部",
				20005 => "俱乐部活动成员报名失败",
				20006 => "你已经申请过了该俱乐部的活动",
				20007 => "申请的俱乐部名称不能为空",
				20008 => "申请的俱乐部简介不能为空",
				20009 => "申请的俱乐部logo图片不能为空",
				20010 => "申请的俱乐部logo图片上传失败",
				20011 => "俱乐部申请提交失败",
				20012 => "俱乐部的活动名称不能为空",
				20013 => "俱乐部的活动内容不能为空",
				20014 => "俱乐部的活动城市不能为空",
				20015 => "俱乐部的活动地址不能为空",
				20016 => "俱乐部的活动开始时间不能为空",
				20017 => "俱乐部的活动结束时间不能为空",
				20018 => "俱乐部的活动限定的俱乐部不能为空",
				20019 => "俱乐部的活动限定的性别不能为空",
				20020 => "俱乐部的活动限定的最小年龄不能为空",
				20021 => "俱乐部的活动限定的最大年龄不能为空",
				20022 => "俱乐部的活动要求最低学历不能为空",
				20023 => "俱乐部的活动要求最多男士数不能为空",
				20024 => "俱乐部的活动要求最多女士数不能为空",
				20025 => "俱乐部的活动报名截止时间不能为空",
				20026 => "俱乐部活动申请提交失败",
				20027 => "该用户没有管理权限的俱乐部",
				20028 => "俱乐部留言内容不能为空",
				20029 => "俱乐部留言发布失败",
				20030 => "活动留言内容不能为空",
				20031 => "活动留言发布失败",
				20032 => "你的性别不符合要求",
				20033 => "你的年龄不符合要求",
				20034 => "你的学历不符合要求",
				20035 => "已经过了最后报名截止时间",
				20036 => "已经没有男性成员名额了",
				20037 => "已经没有女性成员名额了",
				20038 => "你必须参加过俱乐部才能报名哦",
				20039 => "你不是该俱乐部成员",
				20040 => "你不是指定俱乐部成员" 
		) 
)
;
