<?php
class Resourcearr {
	public static function learn_type() {
		return array (
				1 => '自主学习',
				2 => '反馈跟踪',
				3 => '能力延伸',
				4 => '知识拓展',
				5 => '情景字典',
				6 => '典型例题',
				7 => '同步练习',
				8 => '同步听力',
				9 => '反馈练习',
				10 => '本讲要点',
				11 => '同步课堂',
				12 => '重难点讲解',
				13 => '在线测试',
				14 => '情景对话',
				15 => '知识讲解',
				16 => '课外拓展',
				17 => '观察与思考',
				18 => '课外导读',
				19 => '学习目标',
				20 => '伴读锦囊',
				21 => '素材积累',
				22 => '课外阅读',
				23 => '单元要点',
				24 => '整合复习',
				25 => '单元测试',
				26 => '高考链接',
				27 => '作文链接',
				28 => '方法技巧',
				29 => '知识结构',
				30 => '整合提高',
				31 => '链接高考',
				32 => '词汇讲解',
				33 => '课文讲解',
				34 => '语法讲解',
				35 => '写作指导',
				36 => '水平测试',
				37 => '目标词汇',
				38 => '在线听力',
				39 => '单词学习',
				40 => '单词测试' 
		);
	}
	public static function con_resource() {
		return array (
				1 => '同步资源',
				2 => '精品资源',
				3 => '精品网校' 
		);
	}
	public static function file_type() {
		return array (
				1 => "课件",
				2 => "文本",
				3 => "网页",
				4 => "视频",
				5 => "音频",
				6 => "动画",
				7 => "其它",
				8 => "图片",
				9 => "动画" 
		);
	}
	public static function con_resource_grade() {
		return array (
				1 => '小学一年级',
				2 => '小学二年级',
				3 => '小学三年级',
				4 => '小学四年级',
				5 => '小学五年级',
				6 => '小学六年级',
				7 => '初中一年级',
				8 => '初中二年级',
				9 => '初中三年级',
				10 => '高中一年级',
				11 => '高中二年级',
				12 => '高中三年级' 
		);
	}
	public static function con_resource_subject() {
		return array ();
	}
}